app/views/events/show.html.erb

<h3>Nombre de participant :</h3>
<p><%=@event.attendances.length%></p>
---
SELECT "attendances".* FROM "attendances" WHERE "attendances"."event_id" = $1  [["event_id", 1]]