app/controllers/application_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def is_admin?
    post_params = params.permit(:id)
    @event = Event.find_by(id: params[:id])

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "attendances".* FROM "attendances" WHERE "attendances"."event_id" = $1 AND "attendances"."user_id" = $2 LIMIT $3  [["event_id", 2], ["user_id", 2], ["LIMIT", 1]]
---
  def is_user_new_for_event?
    post_params = params.permit(:id)
    @event = Event.find_by(id: params[:id])
    current_user != @event.creator && current_user != @event.attendances.find_by(user_id: current_user.id)