app/controllers/attendances_controller.rb

SELECT "attendances".* FROM "attendances" WHERE "attendances"."event_id" = $1  [["event_id", 1]]
---
  def index
    params.permit(:event)
    @event_id = params[:event]
    @all = Attendance.where(event_id: @event_id)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def new
    params.permit(:event)
    @event_id = params[:event]
    @user = User.find(current_user.id)