app/controllers/charges_controller.rb

  def new
    params.permit(:event)
    @event_id = params[:event]
    @event = Event.find(@event_id)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def new_attendance
    if @b == @a
      bla = Attendance.new(stripe_customer_id: @b, user_id: current_user.id, event_id: @event_id)
      bla.save
---
INSERT INTO "attendances" ("stripe_customer_id", "user_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["stripe_customer_id", "cus_EWdzlIZBgQ2slC"], ["user_id", 2], ["event_id", 2], ["created_at", "2019-02-14 03:15:36.213566"], ["updated_at", "2019-02-14 03:15:36.213566"]]