app/controllers/events_controller.rb

INSERT INTO "events" ("creator_id", "start_date", "duration", "title", "description", "price", "location", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    event = Event.new(events_params)
    puts event.inspect
    event.creator_id = current_user.id
    event.save