app/views/attendances/index.html.erb

  <div class="card-header">
    <h5 class="card-title"><%= i.user.first_name %></h5>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]